.config/emacs/README.org
#+TITLE: Emacs Custom Configuration 
#+CREATOR: Ricardo Gomez 
#+AUTHOR: Ricardo Gomez
#+EMAIL: rgomezgerardi@gmail.com
#+PROPERTY: header-args :tangle init.el :noweb strip-export :cache yes

* Order
Order of blocks that must be tangle before the rest.

#+begin_src emacs-lisp
  <<library>>

  <<straight>>

  <<use-package>>

  <<gcmh>>

  <<doom-themes>>

  <<doom-modeline>>

  <<exec-path-from-shell>>

  <<no-littering>>

  <<general>>
#+end_src

* Editing
Basic text editing facilities.

** Editing Basics
Most basic editing facilities.

#+begin_src emacs-lisp
  (setq-default tab-width 4)  ; Distance between tab stops, in columns
#+end_src

** Electricity
Electric behavior for self inserting keys.

#+begin_src emacs-lisp
  (use-package electric
    :demand
    :custom
    (electric-indent-inhibit t)  ; Auto close bracket insertion
    (electric-pair-pairs '((?\" . ?\") (?\{ . ?\})))
    (electric-indent-chars '(?\n ?\^?))
    :config
    (electric-indent-mode 0)  ; Toggle on-the-fly reindentation 
    (electric-layout-mode 0)  ; Automatically insert newlines around some chars
    (electric-pair-mode 0))  ; Toggle automatic parens pairing
#+end_src

** Emulations
Emulations of other editors.

*** Evil
Extensible Vi layer for Emacs.
https://github.com/emacs-evil/evil

#+begin_src emacs-lisp
(use-package evil
  :demand
  :custom
  (evil-respect-visual-line-mode t)
  (evil-shift-width 4)
  (evil-split-window-below t)
  (evil-undo-system 'undo-tree)
  (evil-vsplit-window-right t)
  (evil-want-C-i-jump nil)
  (evil-want-C-u-scroll nil)
  (evil-want-integration t)
  (evil-want-keybinding nil)
  (evil-auto-indent nil)
  (evil-echo-state nil)
  :config
  (evil-mode 1)
  ;; (evil-set-initial-state 'messages-buffer-mode 'normal)
  :general
  ('motion
   "j" #'evil-next-visual-line
   "k" #'evil-previous-visual-line)
  ('insert
   "C-g" #'evil-normal-state
   "TAB" #'tab-to-tab-stop))
;; "C-h" #'evil-delete-backward-char-and-join))
#+end_src

**** Evil Collection
A set of keybindings for Evil mode
https://github.com/emacs-evil/evil-collection

#+begin_src emacs-lisp
  (use-package evil-collection
    :demand
    :after evil
    :custom
    ;; (setq evil-collection-company-use-tng nil)  ; Is this a bug in evil-collection ?
    (evil-collection-outline-bind-tab-p nil)
    :config
    (evil-collection-init))
#+end_src

**** Evil Nerd Comment
Comment/uncomment lines efficiently. Like Nerd Commenter in Vim
https://github.com/redguardtoo/evil-nerd-commenter

#+begin_src emacs-lisp
;; (defun counsel-imenu-comments ()
;; 	(interactive)
;; 	(let* ((imenu-create-index-function 'evilnc-imenu-create-index-function))
;; 	  (unless (featurep 'counsel) (require 'counsel))
;; 	  (counsel-imenu)))

(use-package evil-nerd-commenter
  :after evil
  :general
  ("C-;" 'evilnc-comment-or-uncomment-lines))
#+end_src

**** Evil Smartparens
Evil smartparens is a minor mode which makes evil play nice with smartparens.
https://github.com/expez/evil-smartparens

#+begin_src emacs-lisp :tangle no
(use-package evil-smartparens
  :after (evil smartparens)
  :hook (smartparens-enabled . evil-smartparens-mode)
  :config
  (defun who-called-me? (old-fun format &rest args)
  (let ((trace nil) (n 1) (frame nil))
    (while (setf frame (backtrace-frame n))
        (setf n     (1+ n) 
              trace (cons (cadr frame) trace)) )
      (apply old-fun (concat "<<%S>>\n" format) (cons trace args))))

  
  (defun suppress-messages (old-fun &rest args)
	(cl-flet ((silence (&rest args1) (ignore)))
      (advice-add 'message :around #'silence)
      (unwind-protect
          (apply old-fun args)
		(advice-remove 'message #'silence))))

  ;; (advice-add 'message :around #'who-called-me?)
  (advice-add 'evil-sp-delete :around #'suppress-messages))

  ;; :config ())  ; Show message if verbose is activated
#+end_src

*** Vi Tilde Fringe
Displays tildes in the fringe on empty lines a la Vi.
https://github.com/syl20bnr/vi-tilde-fringe

#+begin_src emacs-lisp
(use-package vi-tilde-fringe
  :ghook '(conf-mode-hook prog-mode-hook text-mode-hook)
  :gfhook ('(org-mode-hook
			 dashboard-mode-hook) #'(lambda () (vi-tilde-fringe-mode 0)))  ; Disable for some modes
  :config ())  ; Show message if verbose is activated
#+end_src

** Fill
Indenting and filling text.

** Indent
Indentation commands.

#+begin_src emacs-lisp
  (setq-default indent-tabs-mode t)
#+end_src

** Killing
Killing and yanking commands.

#+begin_src emacs-lisp
  (setq backward-delete-char-untabify-method 'hungry)
#+end_src

** Matching
Various sorts of searching and matching.

*** Counsel
Various completion functions using Ivy
https://github.com/abo-abo/swiper

#+begin_src emacs-lisp :tangle no
(use-package counsel
  :custom
  (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
  (ivy-initial-inputs-alist nil) ; Don't start searches with ^
  :config
  (with-eval-after-load 'helpful
	(counsel-describe-function-function #'helpful-callable)
	(counsel-describe-variable-function #'helpful-variable))
  :general
  ("M-x" #'counsel-M-x)
  ("M-/" #'counsel-outline)
  (minibuffer-local-map
	"C-r" 'counsel-minibuffer-history)
  (:states 'normal :keymaps 'eshell-mode-map
		   "C-r" #'counsel-esh-history)
  (my-leader-def
	"SPC"   '(counsel-M-x :which-key "M-x")
	"."     '(counsel-find-file :which-key "find file")
	"s h"   '(counsel-esh-history :which-key "Eshell history")
	"r"   '(counsel-recentf :which-key "Recent files")))
#+end_src

** Mouse
Input from the mouse.

#+begin_src emacs-lisp
  ; Zoom In/Out
  (general-def
    "<C-wheel-up>" 'text-scale-increase
    "<C-wheel-down>" 'text-scale-decrease)
#+end_src

** Smartparens
A minor mode for dealing with pairs in Emacs.
https://github.com/Fuco1/smartparens

#+begin_src emacs-lisp
(use-package smartparens
  :hook ((prog-mode
		  text-mode
		  conf-mode) . (lambda ()
						 (smartparens-mode 1)
						 (show-smartparens-mode 1)))
  :config ())  ; Show message if verbose is activated
  ;; :config
  ;; (add-hook 'minibuffer-setup-hook 'turn-on-smartparens-strict-mode))
  ;; (smartparens-global-strict-mode 1))
;;sp-ignore-mode-list
#+end_src

** Undo
Undoing changes in buffers.

*** Undo Tree
Treat undo history as a tree
https://gitlab.com/tsc25/undo-tree

#+begin_src emacs-lisp
  (use-package undo-tree
    :hook (after-init . global-undo-tree-mode)
    :config ())  ; Show message if verbose is activated
#+end_src

** YASnippet
A template system for Emacs.
https://github.com/joaotavora/yasnippet

#+begin_src emacs-lisp
(use-package yasnippet
  :ghook ('(conf-mode-hook prog-mode-hook text-mode-hook) #'yas-minor-mode)
  :config ())  ; Show message if verbose is activated
#+end_src

*** Doom Snippets
Doom Emacs' Snippet Library
https://github.com/hlissner/doom-snippets

#+begin_src emacs-lisp
(use-package doom-snippets
  :after yasnippet
  :straight (doom-snippets :type git :host github :repo "hlissner/doom-snippets" :files ("*.el" "*")))
#+end_src

*** YASnippet Snippets
Yasnippet official snippet collections
https://github.com/AndreaCrotti/yasnippet-snippets

#+begin_src emacs-lisp :tangle no
(use-package yasnippet-snippets)
#+end_src
   
* Convenience
Convenience features for faster editing.

** Abbreviations
Abbreviation handling, typing shortcuts, macros.

** All the Icons
A library for inserting Developer icons
https://github.com/domtronn/all-the-icons.el

#+begin_src emacs-lisp
  (use-package all-the-icons
	:demand
    :config ())  ; Show message if verbose is activated
#+end_src
   
** Centaur Tabs
Display a tab bar in the header line.
https://github.com/ema2159/centaur-tabs

#+begin_src emacs-lisp
(use-package centaur-tabs
  :preface
  (defun centaur-tabs-buffer-groups ()
    "`centaur-tabs-buffer-groups' control buffers' group rules.

    Group centaur-tabs with mode if buffer is derived from `eshell-mode' `emacs-lisp-mode' `dired-mode' `org-mode' `magit-mode'.
    All buffer name start with * will group to \"Emacs\".
    Other buffer group by `centaur-tabs-get-group-name' with project name."
    (list
     (cond
	  ((or (string-equal "*" (substring (buffer-name) 0 1))
	   (memq major-mode '(magit-process-mode
			  magit-status-mode
			  magit-diff-mode
			  magit-log-mode
			  magit-file-mode
			  magit-blob-mode
			  magit-blame-mode
			  )))
   "Emacs")
  ((derived-mode-p 'prog-mode)
   "Prog")
  ((derived-mode-p 'dired-mode)
   "Dired")
  ((memq major-mode '(helpful-mode
					  help-mode))
   "Help")
  ((memq major-mode '(org-mode
			  org-agenda-clockreport-mode
			  org-src-mode
			  org-agenda-mode
			  org-beamer-mode
			  org-indent-mode
			  org-bullets-mode
			  org-cdlatex-mode
			  org-agenda-log-mode
			  diary-mode))
   "Org")
  (t
   (centaur-tabs-get-group-name (current-buffer))))))
  :hook (after-init . centaur-tabs-mode) 
  ; Disable centaur-tabs in selected buffers
  ((dired-mode 
    dashboard-mode 
    help-mode
    helpful-mode
	special-mode
    term-mode
    delayed-warning
	debugger-mode
    calendar-mode
	ibuffer-mode
	buffer-menu-mode
	messages-buffer-mode
    org-agenda-mode
    helpful-mode
    popup-buffer-mode) . centaur-tabs-local-mode)
  :custom
  (centaur-tabs-style "bar")
  (centaur-tabs-height 32)
  (centaur-tabs-set-icons t)
  (centaur-tabs-plain-icons nil)
  (centaur-tabs-gray-out-icons 'buffer)
  (centaur-tabs-set-bar 'left)
  ;; (x-underline-at-descent-line t)  ; Set this only if centaur-tabs-set-bar is 'under
  (centaur-tabs-set-modified-marker t)
  (centaur-tabs-close-button "✕")
  (centaur-tabs-modified-marker "•")
  (centaur-tabs-cycle-scope 'tabs)
  :config
  (centaur-tabs-mode 1)
  (centaur-tabs-group-by-projectile-project)  ; Group by projectile project

  (defun centaur-tabs-hide-tab (x)
    "Do no to show buffer X in tabs."
    (let ((name (format "%s" x)))
  (or
   ;; Current window is not dedicated window.
   (window-dedicated-p (selected-window))

   ;; Buffer name not match below blacklist.
   (string-prefix-p "*epc" name)
   (string-prefix-p "*helm" name)
   (string-prefix-p "*Helm" name)
   (string-prefix-p "*Compile-Log*" name)
   (string-prefix-p "*lsp" name)
   (string-prefix-p "*company" name)
   (string-prefix-p "*Flycheck" name)
   (string-prefix-p "*tramp" name)
   (string-prefix-p " *Mini" name)
   (string-prefix-p "*help" name)
   (string-prefix-p "*straight" name)
   (string-prefix-p " *temp" name)
   (string-prefix-p "*Help" name)
   (string-prefix-p "*mybuf" name)

   ;; Is not magit buffer.
   (and (string-prefix-p "magit" name)
	    (not (file-name-extension name)))
   )))
  :general
  ;; (:states 'normal
   ;; "K" 'centaur-tabs-forward
   ;; "J" 'centaur-tabs-backward)
  (my-leader-def
    "t t" '(centaur-tabs--create-new-tab :which-key "New tab")
    "t l" '(centaur-tabs-forward-group :which-key "Go to next tab group")
    "t h" '(centaur-tabs-backward-group :which-key "Go to previous tab group")
    "t g g" '(centaur-tabs-select-beg-tab :which-key "Select the first tab of the group")
    "t G" '(centaur-tabs-select-end-tab :which-key "Select the last tab of the group")
    "t s" '(centaur-tabs-counsel-switch-group :which-key "Show buffer groups")
    "t p" '(centaur-tabs-group-by-projectile-project :which-key "Group by projectile project")
    "t g" '(centaur-tabs-group-buffer-groups :which-key "Use centaur's buffer grouping")
    ; Rebind join, and lookup (default K and J vim keybindigs)
    "k" '(evil-lookup :which-key "Look up the keyword at point")
    "j" '(evil-join :which-key "Join the selected lines")))
#+end_src

** Company
Extensible inline text completion framework.
https://github.com/company-mode/company-mode

#+begin_src emacs-lisp
(use-package company
  :preface
  (defun +/noweb-reference (command &optional arg &rest ignored)
	"Complete `<<' with the names of defined SRC blocks."
	(interactive (list 'interactive))
	(cl-case command
      (interactive (company-begin-backend '+/noweb-reference))
      (init (require 'org-element))
      (prefix (and (eq major-mode 'org-mode)
				   (eq 'src-block (car (org-element-at-point)))
				   (cons (company-grab-line "^<<\\(\\w*\\)" 1) t)))
      (candidates
       (org-element-map (org-element-parse-buffer) 'src-block
		 (lambda (src-block)
		   (let ((name (org-element-property :name src-block)))
			 (when name
			   (propertize
				name
				:value (org-element-property :value src-block)
				:annotation (org-element-property :raw-value (org-element-lineage src-block '(headline)))))))))
      (sorted t)            ; Show candidates in same order as doc
      (ignore-case t)
      (duplicates nil)               ; No need to remove duplicates
      (post-completion               ; Close the reference with ">>"
       (insert ">>"))
      ;; Show the contents of the block in a doc-buffer. If you have
      ;; company-quickhelp-mode enabled it will show in a popup
      (doc-buffer (company-doc-buffer (get-text-property 0 :value arg)))
      (annotation (format " [%s]" (get-text-property 0 :annotation arg)))))
  :hook (after-init . global-company-mode)
  :custom
  (company-minimum-prefix-length 0)
  (company-idle-delay 0.0)
  (company-backends '(company-bbdb
					  company-semantic
					  company-cmake
					  company-capf
					  ;; company-clang
					  company-files
					  (company-dabbrev-code company-gtags company-etags company-keywords)
					  company-oddmuse
					  company-dabbrev
					  ))
  :config
  (add-hook 'css-mode-hook
            (lambda ()
              (set (make-local-variable 'company-backends) '(company-css))))
  (add-hook 'org-mode-hook
            (lambda ()
              (set (make-local-variable 'company-backends) '(company-tempo +/noweb-reference))))
  :general
  (company-active-map
   "<tab>" #'company-indent-or-complete-common))
;; :config ())  ; Show message if verbose is activated
#+end_src   

*** Company Box
A company front-end with icons.
https://github.com/sebastiencs/company-box/   

#+begin_src emacs-lisp :tangle no
   (use-package company-box
     :after company
     :hook (company-mode . company-box-mode))
#+end_src
 
*** Company Emoji
Backend providing autocompletion for emoji.
https://github.com/dunn/company-emoji

#+begin_src emacs-lisp :tangle no
(use-package company-emoji
  :demand
  :after company
  :preface
  (defun --set-emoji-font (frame)
	"Adjust the font settings of FRAME so Emacs can display emoji properly."
	(if (eq system-type 'darwin)
		;; For NS/Cocoa
		(set-fontset-font t 'symbol (font-spec :family "Apple Color Emoji") frame 'prepend)
      ;; For Linux
      (set-fontset-font t 'symbol (font-spec :family "Symbola") frame 'prepend)))
  :config
  ;; For when Emacs is started in GUI mode:
  ;; (--set-emoji-font nil)
  ;; Hook for when a frame is created with emacsclient
  ;; see https://www.gnu.org/software/emacs/manual/html_node/elisp/Creating-Frames.html
  ;; (add-hook 'after-make-frame-functions '--set-emoji-font)
  (add-to-list 'company-backends 'company-emoji))	
#+end_src

