.config/emacs/README.org
** General
Convenience wrappers for keybindings.
https://github.com/noctuid/general.el

#+begin_src emacs-lisp :tangle no :noweb-ref general
(use-package general
  :demand
  :config
  (general-auto-unbind-keys)  ; Automatic Key Unbinding

  (defconst my-leader "SPC")
  (general-create-definer my-leader-def
    :states '(normal insert visual emacs)     
    :keymaps 'override
    :prefix my-leader
    :global-prefix "C-SPC")

  (general-def "<escape>" #'keyboard-escape-quit)

  (my-leader-def
    "e r"   '((lambda () (interactive) (load-file "~/.config/emacs-vanilla/init.el")) :which-key "Reload emacs config")
    "e i"   '((lambda () (interactive) (find-file "~/.config/emacs-vanilla/README.org")) :which-key "Open emacs config")
    "e k"   '((lambda () (interactive) (kill-emacs)) :which-key "Exit the emacs job and kill it")
    "b i"   '(ibuffer :which-key "Ibuffer")
    "b k"   '(kill-current-buffer :which-key "Kill current buffer")
    "b n"   '(next-buffer :which-key "Next buffer")
    "b p"   '(previous-buffer :which-key "Previous buffer")
    "b B"   '(ibuffer-list-buffers :which-key "Ibuffer list buffers")
    "b K"   '(kill-buffer :which-key "Kill buffer")))
					;"t t"   '(toggle-truncate-lines :which-key "Toggle truncate lines")
#+end_src

** Hydra
Make bindings that stick around.
https://github.com/abo-abo/hydra

#+begin_src emacs-lisp
  (use-package hydra
	:config
	  (defhydra hydra-zoom (:timeout 4)
		"zoom"
		("l" text-scale-increase "in")
		("h" text-scale-decrease "out")
		("f" nil "finished" :exit t))

	  (defhydra hydra-yank-pop ()
		"yank"
		("C-y" yank nil)
		("M-y" yank-pop nil)
		("y" (yank-pop 1) "next")
		("Y" (yank-pop -1) "prev")
		("l" helm-show-kill-ring "list" :color blue))   ; or browse-kill-ring
	:general
	  (my-leader-def
		"z z" '(hydra-zoom/body :which-key "scale text")
		"M-y" '(hydra-yank-pop/yank-pop :which-key "yank pop")
		"C-y" '(hydra-yank-pop/yank :which-key "yank")))
#+end_src

** Ivy
Incremental Vertical completYon
https://github.com/abo-abo/swiper

#+begin_src emacs-lisp :tangle no
  (use-package ivy
    :config
    (ivy-mode 1)
    :general
    ("C-s" 'swiper)
    (ivy-minibuffer-map
     "TAB" 'ivy-alt-done
     "M-l" 'ivy-alt-done
     "M-j" 'ivy-next-line
     "M-k" 'ivy-previous-line)
    (ivy-switch-buffer-map
     "M-k" 'ivy-previous-line
     "M-l" 'ivy-done
     "M-d" 'ivy-switch-buffer-kill)
    (ivy-reverse-i-search-map
     "M-k" 'ivy-previous-line
     "M-d" 'ivy-reverse-i-search-kill))
#+end_src

*** Ivy Rich
More friendly display transformer for ivy
https://github.com/Yevgnen/ivy-rich

#+begin_src emacs-lisp :tangle no
  (use-package ivy-rich
    :after ivy
    :config
    (ivy-rich-mode 1))
#+end_src

*** Ivy Hydra 
 Additional key bindings for Ivy
 https://github.com/abo-abo/swiper

 #+begin_src emacs-lisp :tangle no
   (use-package ivy-hydra
     :after (ivy hydra))
 #+end_src
 
** Rainbow Delimiters
Highlight brackets according to their depth
https://github.com/Fanael/rainbow-delimiters

#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :ghook 'prog-mode-hook)
#+end_src

** Rainbow Identifiers
Highlight identifiers according to their names
https://github.com/Fanael/rainbow-identifiers

#+begin_src emacs-lisp :tangle no
  (use-package rainbow-identifiers
    :hook (prog-mode . rainbow-identifiers-mode)
    :config ())  ; Show message if verbose is activated
#+end_src

** Smooth Scrolling
A minor mode which make emacs scroll smoothly.
https://github.com/aspiers/smooth-scrolling

#+begin_src emacs-lisp :tangle no
(use-package smooth-scrolling
  :ghook 'after-init-hook
  :custom
  (smooth-scroll-margin 4)
  (smooth-scroll-strict-margins t)
  :config ())  ; Show message if verbose is activated
#+end_src

** Tab Bar
Frame-local tabs.

#+begin_src emacs-lisp :tangle no
(use-package tab-bar
  :demand
  :custom
  ; Defines what to do when the last tab is closed
  (tab-bar-close-last-tab-choice 'tab-bar-mode-disable)
  (tab-bar-close-tab-select 'left)  ; Defines what tab to select after closing the specified tab
  (tab-bar-new-tab-choice "*scratch*")  ; Defines what to show in a new tab
  (tab-bar-show 1)  ; Defines when to show the tab bar
  :config
  (tab-bar-mode 1)
  :general
  (evil-normal-state-map
   ":" 'execute-extended-command
   "K" 'tab-bar-switch-to-next-tab
   "J" 'tab-bar-switch-to-prev-tab)
  (my-leader-def
    "t t" '(tab-bar-new-tab :which-key "New tab")
    "t q" '(tab-bar-close-tab :which-key "Close tab")
    "t c" '(tab-bar-close-other-tabs :which-key "Close all tabs, except the selected one")
    "t r" '(tab-bar-switch-to-recent-tab :which-key "Recent tab")
    "t k" '(tab-bar-switch-to-next-tab :which-key "Next tab")
    "t j" '(tab-bar-switch-to-prev-tab :which-key "Previous tab")
    "t u" '(tab-bar-undo-close-tab :which-key "Restore the last closed tab")
    "t h" '(tab-bar-history-mode :which-key "Toggle tab history mode")
    "t f" '(find-file-other-tab :which-key "Edit file in another tab")
    ; Rebind join, and lookup (default K and J vim keybindigs)
    "k" '(evil-lookup :which-key "Look up the keyword at point")
    "j" '(evil-join :which-key "Join the selected lines")))
#+end_src

** Treemacs
A tree layout file explorer for Emacs
https://github.com/Alexander-Miller/treemacs

#+begin_src emacs-lisp
(use-package treemacs
  ;; :ghook ('(prog-mode-hook) #'treemacs)
  :custom
  (treemacs-display-in-side-window          nil)
  ;; (treemacs-expand-after-init               t)
  ;; (treemacs-position                        'left)
  ;; (treemacs-silent-filewatch                nil)
  ;; (treemacs-silent-refresh                  nil)
  ;; (treemacs-sorting                         'alphabetic-asc)
  ;; (treemacs-user-mode-line-format           "none")
  (treemacs-width                           28)
  :general
  ("M-0"   #'treemacs-select-window)
  (my-leader-def
	"0 0" #'treemacs
	"0 b" #'treemacs-bookmark
	"0 t" #'treemacs-find-tag
	"0 f" #'treemacs-find-file
	"0 d" #'treemacs-delete-other-windows))
#+end_src
   
** Whitespace
Visualize blanks (TAB, (HARD) SPACE and NEWLINE).

#+begin_src emacs-lisp :tangle no
  (use-package whitespace
    :straight nil
    :hook (prog-mode . highlight-indent-guides-mode)
    :custom
    (whitespace-display-mappings  ; Specify an alist of mappings for displaying characters
     '((tab-mark 9 [8677 9] [92 9])  ;| 124  ⇥ 8677  ⇨ 8680  ↦ 8614
       (space-mark 32 [183] [46])
       (newline-mark 10 [182 10])))
    (whitespace-style '(tabs tab-mark))  ; Specify which kind of blank is visualized
    ; Tabs tab-mark trailing indentation indentation::tab indentation::space
    :custom-face
    (whitespace-tab ((t (:foreground "#c1c1c1"))))
    :config 
    (whitespace-mode 1))  ; Toggle whitespace visualization globally
#+end_src

* Files
Support for editing files.

#+begin_src emacs-lisp :tangle early-init.el
  ;; (use-package files
  ;;   :ensure nil
  ;;   :custom (revert-buffer-function 'inform-revert-modified-file))

  ; Prevent Emacs from asking "modified buffers exist; exit anyway?"
  (defun +/my-save-buffers-kill-emacs (&optional arg)
	"Offer to save each buffer(once only), then kill this Emacs process.
  With prefix ARG, silently save all file-visiting buffers, then kill."
	(interactive "P")
	(save-some-buffers arg t)
	(and (or (not (fboundp 'process-list))
		 ;; process-list is not defined on MSDOS.
		 (let ((processes (process-list))
		   active)
		   (while processes
			 (and (memq (process-status (car processes)) '(run stop open listen))
			  (process-query-on-exit-flag (car processes))
			  (setq active t))
			 (setq processes (cdr processes)))
		   (or (not active)
		   (progn (list-processes t)
			  (yes-or-no-p "Active processes exist; kill them and exit anyway? ")))))
		 ;; Query the user for other things, perhaps.
		 (run-hook-with-args-until-failure 'kill-emacs-query-functions)
		 (or (null confirm-kill-emacs)
		 (funcall confirm-kill-emacs "Really exit Emacs? "))
		 (kill-emacs)))
  (fset 'save-buffers-kill-emacs '+/my-save-buffers-kill-emacs)

  ; Smooth Scroll
  (setq 
   ;; redisplay-dont-pause nil
		;; scroll-margin 3
		scroll-step 1)
		;; scroll-conservatively 10000
		;; scroll-preserve-screen-position 1)

   ;; (setq scroll-margin 1
   ;;      scroll-conservatively 0
   ;;      scroll-up-aggressively 0.01
   ;;      scroll-down-aggressively 0.01)
   ;;    (setq-default scroll-up-aggressively 0.01
   ;; (setq scroll-conservatively 10000)
	  ;; (setq auto-window-vscroll nil);;      scroll-down-aggressively 0.01)

#+end_src

** Auto Save
Preventing accidental loss of data.

#+begin_src emacs-lisp :tangle early-init.el
(setq auto-save-interval 500)
#+end_src

** Backup 
Backups of edited data files.

#+begin_src emacs-lisp :tangle early-init.el
  (setq make-backup-files nil)  ; Non-nil means make a backup of a file the first time it is saved.
#+end_src

** Dired
Directory editing.

#+begin_src emacs-lisp :tangle no
(use-package dired
  :straight (:type built-in)
  :custom
  (dired-listing-switches "-ahl -v --group-directories-first")
  (dired-auto-revert-buffer t)  ; Automatically revert Dired buffers on revisiting their directory
  (dired-dwim-target t)  ; suggest a target for moving/copying intelligently
  (dired-hide-details-hide-symlink-targets nil)
  (dired-recursive-copies  'always)  ; Always copy/delete recursively
  (dired-recursive-deletes 'top)  ; Whether dired deletes directories recursively
  (dired-create-destination-dirs 'ask)
  :config
  ; Don't complain about this command being disabled when we use it
  (put 'dired-find-alternate-file 'disabled nil)
  :general
  (:states 'normal :keymaps 'dired-mode-map
	  "h" #'dired-up-directory
	  "l" #'dired-find-file))
#+end_src

*** All the Icons Dired
A library for inserting Developer icons
https://github.com/domtronn/all-the-icons.el

#+begin_src emacs-lisp :tangle no
  (use-package all-the-icons-dired
    :after dired
    :hook (dired-mode . all-the-icons-dired-mode))
#+end_src
    
*** Ranger

#+begin_src emacs-lisp
  ;; (use-package ranger
  ;; :demand
  ;; :init (ranger-override-dired-mode t))
  ;; :init (setq ranger-override-dired t))
  ;; :custom 
  ;; (ranger-cleanup-on-disable t)
  ;; (ranger-excluded-extensions '("mkv" "iso" "mp4"))
  ;; (ranger-deer-show-details t)
  ;; (ranger-max-preview-size 10)
  ;; (ranger-show-literal nil)
  ;; (ranger-hide-cursor nil)
#+end_src

*** Rsync
Asynchronous rsync from dired
https://github.com/stsquad/dired-rsync

#+begin_src emacs-lisp :tangle no
(use-package dired-rsync
  :general
  (dired-mode-map "C-c C-r" 'dired-rsync))
#+end_src>

*** Diredfl
Extra font lock rules for a more colourful dired
https://github.com/purcell/diredfl

#+begin_src emacs-lisp :tangle no
(use-package diredfl
  :hook (dired-mode . diredfl-mode))
#+end_src>

*** Diredx

#+begin_src emacs-lisp :tangle no
  (use-package dired-x
	:straight nil
	:hook (dired-mode . dired-omit-mode)
	:config
	(setq dired-omit-verbose nil
		  dired-omit-files
		  (concat dired-omit-files
				  "\\|^.DS_Store\\'"
				  "\\|^.project\\(?:ile\\)?\\'"
				  "\\|^.\\(svn\\|git\\)\\'"
				  "\\|^.ccls-cache\\'"
				  "\\|\\(?:\\.js\\)?\\.meta\\'"
				  "\\|\\.\\(?:elc\\|o\\|pyo\\|swp\\|class\\)\\'"))
	;; Disable the prompt about whether I want to kill the Dired buffer for a
	;; deleted directory. Of course I do!
	(setq dired-clean-confirm-killing-deleted-buffers nil))
	;; Let OS decide how to open certain files
	;; (map! :map dired-mode-map
	;; 	  :localleader
	;; 	  "h" #'dired-omit-mode))
#+end_src

*** Fd-dired
https://github.com/yqrashawn/fd-dired

#+begin_src emacs-lisp :tangle no
(use-package fd-dired
  :defer t
  :init
  (global-set-key [remap find-dired] #'fd-dired))
#+end_src

*** Dired Aux

#+begin_src emacs-lisp :tangle no
  (use-package dired-aux
	:straight nil
	:defer t
	:config
	(setq dired-create-destination-dirs 'ask
		  dired-vc-rename-file t))
#+end_src

*** Diff-hl
Highlight uncommitted changes using VC
https://github.com/dgutov/diff-hl

#+begin_src emacs-lisp :tangle no
(use-package diff-hl
  :hook 
  (dired-mode . diff-hl-dired-mode-unless-remote)
  (magit-post-refresh . diff-hl-magit-post-refresh)
  :config
  ; use margin instead of fringe
  (diff-hl-margin-mode))
#+end_src>

*** Single
Reuse the current dired buffer to visit a directory
https://github.com/crocket/dired-single

#+begin_src emacs-lisp :tangle no
  (use-package dired-single
    :after dired)
    ;:config
    ;(:keymaps '(dired-mode-map evil-normal-state-map)
    ;(evil-collection-define-key 'normal 'dired-mode-map
     ;"h" 'dired-single-up-directory
     ;"l" 'dired-single-buffer))
#+end_src

*** Hide Dotfiles
Hide dotfiles in dired
https://github.com/mattiasb/dired-hide-dotfiles

#+begin_src emacs-lisp :tangle no
  (use-package dired-hide-dotfiles
    :after dired
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :general
    (dired-mode-map
      "H" 'dired-hide-dotfiles-mode))
#+end_src    

*** Open
Open files from dired using using custom actions

#+begin_src emacs-lisp :tangle no
  (use-package dired-open
    :after dired
    :commands
    (dired dired-jump)
    :config
    ;; Doesn't work as expected!
    ;(add-to-list 'dired-open-functions #'dired-open-xdg t)
    ;; -- OR! --
    (setq dired-open-extensions '(("png" . "sxiv")
				  ("mkv" . "mpv"))))
#+end_src
    
*** Peep Dired
*** Empty

#+begin_src emacs-lisp
  ;(setq split-height-threshold nil)
  ;(setq split-width-threshold 0)

  ;(custom-set-variables
  ; '(ediff-window-setup-function 'ediff-setup-windows-plain)
  ; '(ediff-diff-options "-w")
  ; '(ediff-split-window-function 'split-window-horizontally))
  ;(add-hook 'ediff-after-quit-hook-internal 'winner-undo)

  ;(setq split-width-threshold (- (window-width) 10))
  ;(setq split-height-threshold nil)
  ;
  ;(defun count-visible-buffers (&optional frame)
  ;  "Count how many buffers are currently being shown. Defaults to selected frame."
  ;  (length (mapcar #'window-buffer (window-list frame))))
  ;
  ;(defun do-not-split-more-than-two-windows (window &optional horizontal)
  ;  (if (and horizontal (> (count-visible-buffers) 1))
  ;      nil
  ;    t))
  ;
  ;(advice-add 'window-splittable-p :before-while #'do-not-split-more-than-two-windows)
#+end_src

** Find File
Finding files.

