.config/emacs/README.org
** Display
How characters are displayed in buffers.

#+begin_src emacs-lisp :tangle no
  ; Flash the mode-line to ring the alarm bell
  (setq visible-bell nil
	ring-bell-function
	(lambda ()
	  (unless (memq this-command
			'(isearch-abort abort-recursive-edit exit-minibuffer keyboard-quit evil-force-normal-state))
	    (invert-face 'mode-line)
	    (run-with-timer 0.1 nil #'invert-face 'mode-line))))
#+end_src

*** Line Numbers
Display line numbers in the buffer.

#+begin_src emacs-lisp
; Enable line numbers for some modes
(dolist (mode '(text-mode-hook
				prog-mode-hook
				conf-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 1))))

; Disable line numbers for some modes
(dolist (mode '(term-mode-hook
				dashboard-mode-hook
				org-mode-hook
				treemacs-mode-hook
				eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Exec Path from Shell
Make Emacs use shell-defined such as $PATH etc.
https://github.com/purcell/exec-path-from-shell

#+begin_src emacs-lisp :tangle no :noweb-ref exec-path-from-shell
(use-package exec-path-from-shell
  :demand
  :config
  ;(pcase system-type
  ;  ('gnu/linux "It's Linux!")
  ;  ('windows-nt "It's Windows!")
  ;  ('darwin "It's macOS!"))
  (when (memq system-type '(gnu/linux darwin))
	(exec-path-from-shell-initialize)))
#+end_src

** Frames
Support for Emacs frames and window systems.

#+begin_src emacs-lisp :tangle early-init.el
  (menu-bar-mode 0)  ; Toggle display of a menu bar on each frame
  (scroll-bar-mode 0)  ; Toggle vertical scroll bars on all frames
  (tool-bar-mode 0)  ; Toggle the tool bar in all graphical frames
  ; Alist of default values for frame creation
  (set-frame-parameter (selected-frame) 'alpha '(100 . 100))
       (add-to-list 'default-frame-alist '(alpha . (100 . 100)))
#+end_src

*** Fringe
Window fringes.

#+begin_src emacs-lisp :tangle early-init.el
  ; Default appearance of fringes on all frames.
  (setq set-fringe-mode 10)        ; Give some breathing room
#+end_src
   
** Initialization
Emacs start-up procedure.

#+begin_src emacs-lisp :tangle early-init.el
(setq inhibit-startup-echo-area-message t
	  ;; inhibit-startup-screen t
	  user-emacs-directory-warning t)

; Buffer to show after starting Emacs
(if (daemonp)  ; This is needed for emacsclient
	(setq initial-buffer-choice
		  (lambda () (get-buffer "*Messages*"))))

; Disable startup echo area message
(put 'inhibit-startup-echo-area-message 'saved-value t)
(setq inhibit-startup-echo-area-message (user-login-name))
;(fset 'display-startup-echo-area-message 'ignore)

;; (add-hook 'emacs-startup-hook #'+/display-startup-time)
#+end_src

** Minibuffer
Controlling the behavior of the minibuffer.

*** Consult
Practical commands based on the Emacs completion function completing-read.
https://github.com/minad/consult

#+begin_src emacs-lisp
(use-package consult
  :config
  ; Optionally configure a function which returns the project root directory.
  (autoload 'projectile-project-root "projectile")
  (setq consult-project-root-function #'projectile-project-root)
  :general
  ("M-p" 'consult-yank-pop)
  (:states 'normal :keymaps 'org-mode-map
   "M-/" 'consult-org-heading)
  (isearch-mode-map
   "M-e" 'consult-isearch                 ;; orig. isearch-edit-string
   "M-s e" 'consult-isearch               ;; orig. isearch-edit-string
   "M-s l" 'consult-line                  ;; needed by consult-line to detect isearch
   "M-s L" 'consult-line-multi)           ;; needed by consult-line to detect isearch
  (my-leader-def
	":" 'consult-complex-command
	"@" 'consult-register
	"#" 'consult-register-load
	"'" 'consult-register-store

    "h a" 'consult-apropos
	
	"c h" 'consult-history
	"c m" 'consult-mode-command
    "c b" 'consult-bookmark
    "c k" 'consult-kmacro

    "SPC" '(consult-buffer :which-key "Switch to buffer")
    "b w" '(consult-buffer-other-window :which-key "Switch to buffer other window")
    "b f" '(consult-buffer-other-frame :which-key "Switch to buffer other frame")

    "g l" 'consult-goto-line
	"g e" 'consult-compile-error
    "g f" 'consult-flymake  ;; Alternative: consult-flycheck
    "g o" 'consult-outline
    "g m" 'consult-mark
    "g k" 'consult-global-mark
    "g i" 'consult-imenu
    "g I" 'consult-imenu-multi

	"s f" 'consult-find
    "s F" 'consult-locate
    "s g" 'consult-grep
    "s G" 'consult-git-grep
    "s r" 'consult-ripgrep
    "s l" 'consult-line
    "s L" 'consult-line-multi
    "s m" 'consult-multi-occur
    "s k" 'consult-keep-lines
    "s u" 'consult-focus-lines
	"s e" 'consult-isearch))
#+end_src

**** Consult LSP
Let’s try to mimic a few features of helm-lsp and lsp-ivy in consult workflow.
https://github.com/gagbo/consult-lsp

#+begin_src emacs-lisp
(use-package consult-lsp
  :config
  (define-key lsp-mode-map [remap xref-find-apropos] #'consult-lsp-symbols))
#+end_src

*** Marginalia
Enrich existing commands with completion annotations.
https://github.com/minad/marginalia

#+begin_src emacs-lisp
  (use-package marginalia
    :ghook 'pre-command-hook
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :general
    (minibuffer-local-map
     "C-a" #'marginalia-cycle)
    :config ())  ; Show message if verbose is activated
#+end_src

*** Orderless
Completion method that matches space-separated regexps in any order.
https://github.com/oantolin/orderless

#+begin_src emacs-lisp
  (use-package orderless
	:custom 
	(completion-category-defaults nil)
	(orderless-component-separator "[ &]")
	(completion-styles '(orderless))
	(completion-category-overrides '((file (styles . (orderless partial-completion)))))
	:config ())  ; Show message if verbose is activated
	;; :config
	;; ...otherwise find-file gets different highlighting than other commands
	;; (set-face-attribute 'completions-first-difference nil :inherit nil)

	;; (setq orderless-style-dispatchers '(lambda (pattern _index _total) 
	;;   (cond
	;;    ;; Ensure $ works with Consult commands, which add disambiguation suffixes
	;;    ((string-suffix-p "$" pattern)
	;; 	`(orderless-regexp . ,(concat (substring pattern 0 -1) "[\x100000-\x10FFFD]*$")))
	;;    ;; Ignore single !
	;;    ((string= "!" pattern) `(orderless-literal . ""))
	;;    ;; Without literal
	;;    ((string-prefix-p "!" pattern) `(orderless-without-literal . ,(substring pattern 1)))
	;;    ;; Initialism matching
	;;    ((string-prefix-p "`" pattern) `(orderless-initialism . ,(substring pattern 1)))
	;;    ((string-suffix-p "`" pattern) `(orderless-initialism . ,(substring pattern 0 -1)))
	;;    ;; Literal matching
	;;    ((string-prefix-p "=" pattern) `(orderless-literal . ,(substring pattern 1)))
	;;    ((string-suffix-p "=" pattern) `(orderless-literal . ,(substring pattern 0 -1)))
	;;    ;; Flex matching
	;;    ((string-prefix-p "~" pattern) `(orderless-flex . ,(substring pattern 1)))
	;;    ((string-suffix-p "~" pattern) `(orderless-flex . ,(substring pattern 0 -1)))))))
#+end_src

*** Savehist
Save minibuffer history.

#+begin_src emacs-lisp
  (use-package savehist
    :demand
    :config
    (savehist-mode 1))
#+end_src

*** Vertico
VERTical Interactive COmpletion.
https://github.com/minad/vertico

#+begin_src emacs-lisp
(use-package vertico
  :demand
  :preface
  (defun +/vertico-backward-updir ()
	"Delete char before or go up directory for file cagetory vertico buffers."
	(interactive)
	(let ((metadata (completion-metadata (minibuffer-contents)
   										 minibuffer-completion-table
   										 minibuffer-completion-predicate)))
	  (if (and (eq (char-before) ?/)
   			   (eq (completion-metadata-get metadata 'category) 'file))
   		  (let ((new-path (minibuffer-contents)))
   			(delete-region (minibuffer-prompt-end) (point-max))
   			(insert (abbreviate-file-name
   					 (file-name-directory
   					  (directory-file-name
   					   (expand-file-name new-path))))))
   		(call-interactively 'backward-delete-char))))
  :custom
  (vertico-count 16)
  (vertico-cycle t)  ; Optionally enable cycling for `vertico-next' and `vertico-previous'
  (vertico-resize nil)  ; Grow and shrink the Vertico minibuffer
  ;; (enable-recursive-minibuffers t)  ; Enable recursive minibuffers
  :config
  (vertico-mode 1)
  ;; (setq minibuffer-prompt-properties  ; Do not allow the cursor in the minibuffer prompt
  ;; 		'(read-only t cursor-intangible t face minibuffer-prompt))
  ;; (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
  :general
  (vertico-map
   "M-j" #'vertico-next
   "M-S-j" #'vertico-next-group
   "M-k" #'vertico-previous
   "M-S-k" #'vertico-previous-group
   "M-RET" #'vertico-exit-input
   "<backspace>" #'+/vertico-backward-updir)
  (minibuffer-local-map
   "M-h" #'backward-kill-word))
#+end_src

*** Mini Frame
Place minibuffer at the top of the current frame on read-from-minibuffer.
https://github.com/muffinmad/emacs-mini-frame

#+begin_src emacs-lisp :tangle no
(use-package mini-frame
  :hook (after-init . mini-frame-mode)
  :custom
  (mini-frame-show-parameters
   '((top . 50)
     (width . 0.7)
     (left . 0.5)))
  (mini-frame-ignore-commands
   '(eval-expression
	 "edebug-eval-expression"
	 debugger-eval-expression
	 evil-ex
	 "consult"))
  :config ())  ; Show message if verbose is activated
#+end_src

** Mode Line
Contents of the mode line.

#+begin_src emacs-lisp
  ; Non-nil if Column-Number mode is enabled.
  (setq column-number-mode t)
#+end_src

*** Doom Modeline
A fancy and fast mode-line inspired by minimalism design.
https://github.com/seagle0128/doom-modeline

#+begin_src emacs-lisp :tangle no :noweb-ref doom-modeline
  (use-package doom-modeline
    :demand
	:custom
	(doom-modeline-height 16)  ; How tall the mode-line should be
	(doom-modeline-icon t)  ; Whether display icons in the mode-line
	(doom-modeline-indent-info nil)  ; Whether display the indentation information
	:config
    (doom-modeline-mode 1))  ; Show message if verbose is activated
#+end_src
   
* Faces
Support for multiple fonts.

** Basic Faces
The standard faces of Emacs.

#+begin_src emacs-lisp
  ;; (defun +/set-font-faces ()
  ;;   (set-face-attribute 'default nil
  ;; 		  :font "FiraCode Nerd Font"
  ;; 		  :weight 'normal
  ;; 		  :height 120)

  ;;   (set-face-attribute 'fixed-pitch nil
  ;; 		  ;:family "Monospace"
  ;; 		  :font "FiraCode Nerd Font"
  ;; 		  ;:weight 'light
  ;; 		  :height 120)

  ;;   (set-face-attribute 'variable-pitch nil
  ;; 		  ;:family "Monospace"
  ;; 		  :font "Roboto"
  ;; 		  ;:weight 'light
  ;; 		  :height 120
			;; ))

  ; This is needed for the deamon (emacsclient)
  ;; (if (daemonp)
  ;; 	  (add-hook 'after-make-frame-functions ; (Emacs < 27)
  ;; 	  ;(add-hook 'server-after-make-frame-hook
  ;; 		(lambda (frame)
  ;; 		  (with-selected-frame frame
  ;; 			(+/set-font-faces))))
  ;; 	  (+/set-font-faces))
#+end_src

** Doom Themes
Options for doom-themes.
https://github.com/hlissner/emacs-doom-themes

#+begin_src emacs-lisp :tangle no :noweb-ref doom-themes
(use-package doom-themes
  :demand
  :custom
  (doom-themes-enable-bold t)  ; If nil, bold will be disabled across all faces
  (doom-themes-enable-italic t)  ; If nil, italics will be disabled across all faces
  (doom-themes-padded-modeline nil)  ; Default value for padded-modeline setting for themes that support it
  (doom-themes-treemacs-theme "doom-atom")
  :config
  (load-theme 'doom-one t)
  (doom-themes-visual-bell-config)  ; Enable flashing the mode-line on error
  (doom-themes-treemacs-config)  ; Install doom-themes' treemacs configuration
  (doom-themes-org-config))  ; Corrects (and improves) org-mode's native fontification
#+end_src

** Solaired
If only certain buffers could be so grossly incandescent.
https://github.com/hlissner/emacs-solaire-mode

#+begin_src emacs-lisp
(use-package solaire-mode
  :ghook ('after-init-hook #'solaire-global-mode)
  :gfhook ('(dashboard-mode-hook) #'(lambda () (solaire-mode 0)))  ; Disable for some modes
  :config ())  ; Show message if verbose is activated
#+end_src
   
** Highlight Indent Guides
Minor mode to highlight indentation
https://github.com/DarthFennec/highlight-indent-guides

#+begin_src emacs-lisp
(setq doom-theme 'doom-one)

(use-package highlight-indent-guides
  :hook ((prog-mode
		  text-mode
		  conf-mode) . highlight-indent-guides-mode)
  :custom
  (highlight-indent-guides-suppress-auto-error t)
  (highlight-indent-guides-character 9474)  ; | 124  ⇥ 8677  ⇨ 8680  ↦ 8614    default 9474
  (highlight-indent-guides-method 'character)  ; Method to use when displaying indent guides
  (highlight-indent-guides-responsive 'stack)
  (highlight-indent-guides-auto-enabled t)
;; Highlight Indent Guides Character Face
;; Foreground: #3e6a44a85124
;; Highlight Indent Guides Even Face
;; Background: #3e6a44a85124
;; Highlight Indent Guides Odd Face
;; Background: #3349386a42ac
;; Highlight Indent Guides Stack Character Face
;; Foreground: #54ad5d256e14
;; Highlight Indent Guides Stack Even Face
;; Background: #54ad5d256e14
;; Highlight Indent Guides Stack Odd Face
;; Background: #498c50e65f9c
;; Highlight Indent Guides Top Character Face
;; Foreground: #6af075a18b04
;; Highlight Indent Guides Top Even Face
;; Background: #6af075a18b04
;; Highlight Indent Guides Top Odd Face
;; Background: #5fce69637c8c
  :config
  (defun +indent-guides-init-faces-h (&rest _)
    (when (display-graphic-p)
      (highlight-indent-guides-auto-set-faces)))

  ;; HACK `highlight-indent-guides' calculates its faces from the current theme,
  ;;      but is unable to do so properly in terminal Emacs, where it only has
  ;;      access to 256 colors. So if the user uses a daemon we must wait for
  ;;      the first graphical frame to be available to do.
  (add-hook 'doom-load-theme-hook #'+indent-guides-init-faces-h)
  (when doom-theme
    (+indent-guides-init-faces-h))

  ;; `highlight-indent-guides' breaks when `org-indent-mode' is active
  (+/add-hook 'org-mode-local-vars-hook
    (defun +indent-guides-disable-maybe-h ()
      (and highlight-indent-guides-mode
           (bound-and-true-p org-indent-mode)
           (highlight-indent-guides-mode -1)))))
#+end_src

** Prettify Symbols

#+begin_src emacs-lisp
(global-prettify-symbols-mode 1)  ; Toggle Prettify-Symbols mode in all buffers
(setq prettify-symbols-alist '(("lambda" . 955)))
#+end_src

